In [1]:
import sqlite3

In [3]:
sqlQuery = """
CREATE TABLE test(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);
"""
con=sqlite3.connect('mydata.sqlite')
con.execute(sqlQuery)
con.commit()

In [5]:
data = [
    ('Atlanta', 'Georgia', 1.25, 6),
    ('Tallahassee', 'Florida', 2.6, 3),
    ('Sacramento', 'California', 1.7, 5)
]
sqlQuery1 = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(sqlQuery1, data)
con.commit()

In [6]:
#讀取資料
con = sqlite3.connect('mydata.sqlite')
cursor=con.execute('select * from test')
rows=cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [7]:
#將資料轉成DataFrame
import pandas as pd
dataFrame=pd.DataFrame(rows,columns=['a', 'b', 'c', 'd'])
dataFrame

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5